"""
Напишите программу, которая запрашивает у пользователя число.

Если введённое число больше 10, вывести на экран – «Ваше число больше 10».
Если нет – вывести на экран – «Ваше число не больше 10».
"""

number = int(input("Введите число: "))

str = "Привет, мир"

if number > 10 :
    print("Ваше число больше 10")
else:
    print("Ваше число не больше 10")
