# Задача: Вывести на экран Hello, World!
# Комментарий - способ добавить пояснение к коду
# Ctrl + / - закомментировать строку

# print - команда print выводить информацию на экран
# Текст всегда заключен в кавычки
print("Hello, World!")

# Аргументы. Данные, которые мы передаем команде print, чтобы она знала, что именно выводить - намываются аргументы


