"""

Task 1.
Напишите программу, которая считает произведение двух чисел.

Программа должна запрашивать оба этих числа у пользователя. Рассчитайте произведение и выведите в консоль:

второго и второго числа,
второго и первого числа,
первого и первого числа.
"""


number_1 = int(input("Введите первое число: "))
number_2 = int(input("Введите второе число: "))
result_1 = number_2 * number_2
result_02 = number_2 * number_1
result_03 = number_1 * number_1

print("Результат", result_1 )
print("Результат", result_02 )
print("Результат", result_03 )