"""
Task 1
Напишите программу, которая хранит в переменных данные:
- какой сейчас по счёту день в году (например, 48)
- название следующего года (например, "Год Тигра").
Программа должна посчитать, сколько дней осталось до следующего года и вывести на экран фразу по образцу - "Через 123 дня наступит Год Тигра".
Для упрощения считайте, что в году всегда 365 дней.
"""
day = 242
next_year = "Tiger"
day1 = 365
next_new_year = day1 - day
print("Через", next_new_year, "дня наступит год", next_year) 