"""
Бананы стоят - 11 у.е.
Яблоки стоят - 8 у.е.
Вам нужно купить:
- два килограмма бананов
- три килограмма яблок.
- Сохраните все эти данные в переменных.

Напишите программу, которая выводит на экран фразу "Для покупки Х килограммов бананов и Y килограммов яблок мне нужно Z у.е." В местах, где Х, Y, Z - нужно воспользоваться переменными.
"""
a = 11
b = 8
x = 2
y = 3
z = (2 * a) + (3 * b)

print(f"Для покупки {x} килограммов бананов и {y}  килограммов яблок мне нужно", z, "y.e." )