"""
Task 1.
Напишите программу, которая выводит на экран числа от 10 до 19.

"""


number = 10
while number <= 19:
    print(number)
    number += 1