"""
Task 2.
Создайте список, который состоит из нескольких положительных целых чисел.

Напишите программу, которая определяет и выводит на экран максимальное число списка.

"""


numbers = [12, 56, 144, 88, 100, 28]
max_number = max(numbers)
print("Максимальное число в списке :", max_number)