"""
Task 1.
Создайте список, который содержит несколько названий фруктов.

Выведите его на экран так, чтобы каждое название выводилось с новой строки.
"""


fruits = ["Abrikos", "Apple", "Kiwi", "Banana"]
for fruit in fruits:
    print(fruit)